// ==========================================
// キャラクターリスト
// (Updated: 2026/2/8 22:52:10)
// ==========================================

const CHARACTERS_R4 = [
    {
        "id": "4001",
        "name": "[トレセン学園理事長]秋川理事長",
        "quote": "「豪運ッ！君に幸あれ！」"
    },
    {
        "id": "4002",
        "name": "［ポンタ王国王女］ポンタコテリシャス",
        "quote": "「………マロぉ！？なんで見つけたのじゃあ！？！？」"
    },
    {
        "id": "4003",
        "name": "［あなたの商店街］アマネちゃん",
        "quote": "「ようこそ………私たちの、商店街へっ………！」"
    },
    {
        "id": "4004",
        "name": "［フルエテ ネムレ］トレメーレグルス",
        "quote": "「物語にいなくたって………私の物語は、あの日見た光は、消えていないんだっ！！！」"
    }
];

const CHARACTERS_R3 = [
    {
        "id": "3001",
        "name": "［日ノ本断ツ大太刀］ネネキリミソギ",
        "quote": "「アンタたち……ぜーんいん！ぶった斬ってやるわよ！！」"
    },
    {
        "id": "3002",
        "name": "［Becoming The Legacy］ディレツェッド",
        "quote": "「ウマ娘なら、目立って覚えられてなんぼっしょ！」"
    },
    {
        "id": "3003",
        "name": "［Dual Movement］デュオモンテ",
        "quote": "「箱庭に生かされた花よ、私という路傍の華に枯らされろ」"
    },
    {
        "id": "3004",
        "name": "［星空を見上げて！！！］ホルススターズアイ",
        "quote": "「天才の私が、勝利という輝きをあなたに魅せてあげます！！！」"
    },
    {
        "id": "3005",
        "name": "［原初を穿つダートフォージ］ガンエレメンツ",
        "quote": "「世界を穿いた力、見せてやる。ーー覚悟しときな」"
    },
    {
        "id": "3006",
        "name": "［超越せし帝王］ジャックラパット",
        "quote": "「限界を知らぬ王の走り、その目に焼き付けよ！！」"
    },
    {
        "id": "3007",
        "name": "［貴方の為に鐘は鳴る］カンパネラ",
        "quote": "「この道は私の道、いつか誰かに出会う、その為の」"
    },
    {
        "id": "3008",
        "name": "［Access Answer］アンカーコード",
        "quote": "「繋ぐ…届ける…この眼は、決して見逃さない…っ！」"
    },
    {
        "id": "3009",
        "name": "［王道］キルシュブリューテ",
        "quote": "「相手がどれだけ強くても……主役を譲る気はありません」"
    },
    {
        "id": "3010",
        "name": "［紅輝の女皇］スカーレットクラン",
        "quote": "「伊達と！酔狂と！溢れる浪漫！織りなす輝きこそ余！女皇の行く覇道である！」"
    },
    {
        "id": "3011",
        "name": "［Forge Own Ways］フェルムハルジオン",
        "quote": "「何度でも鍛ち直す、それが私の信念！折れるものなら折ってみなさい！」"
    },
    {
        "id": "3012",
        "name": "［Iris］セイリングデイズ",
        "quote": "「それでも、雨は上がるから。進むよ、この手に虹を掴むまで！」"
    },
    {
        "id": "3013",
        "name": "［piercing the heart］バレットスマッシュ",
        "quote": "「世界中のハートを、私の走りで撃ち抜いてあげるよ」"
    },
    {
        "id": "3014",
        "name": "［リメンバー・フルール］ルミナスシオン",
        "quote": "「わっ……私、だって……刻みたい…！あなたの…記憶に……！」"
    },
    {
        "id": "3015",
        "name": "［新緑の皇帝］トライアンフソング",
        "quote": "「我は征く——喝采と歓声が響く人が夢みる覇道を！」"
    },
    {
        "id": "3016",
        "name": "［Twinkly DIVA］ベッラディーヴァ",
        "quote": "「この歌声で誰かを笑顔にするために……私は、センターに立ちたい……！」"
    },
    {
        "id": "3017",
        "name": "［Let’s Smiling!!］アメージングチア",
        "quote": "「さあ、一緒にみんなを元気づけに行きましょう！」"
    },
    {
        "id": "3018",
        "name": "［天地鳴動］ブザービート",
        "quote": "「いいわ、掛かってきなさい。何度でも纏めて相手してあげる！！」"
    },
    {
        "id": "3019",
        "name": "［for Best Rose］イタルベストローズ",
        "quote": "「咲き誇る姿——ご照覧あれ。私こそイタルの一、高嶺に舞う至高の花弁……薔薇のトゲには、お気をつけて」"
    },
    {
        "id": "3020",
        "name": "［Le Briseur de Gloire］タイムフラグメント",
        "quote": "「相手も、歴史も…姉の価値も！全てを破壊してやるわ！！」"
    },
    {
        "id": "3021",
        "name": "［ナゼ・ソノナ・ナノカ？］ナノナイハナ",
        "quote": "「〜～♪……私の声は、魔性だから♪」"
    },
    {
        "id": "3022",
        "name": "［ビビビっ♡惚れチャイナ］ビッグビッグビッグ",
        "quote": "「おっきな身体に、おっきな愛！　自称むちぽちゃ系ウマ娘、お届けに参りましたっ！！」"
    },
    {
        "id": "3023",
        "name": "［宝石言葉【幸福】］ヒスイランス",
        "quote": "「姉さんに・・・勝ちたい・・・この思いだけは、負けない・・・！」"
    },
    {
        "id": "3024",
        "name": "［ねっとり♡しっとり♡捕縛者♡］コーパルトラップ",
        "quote": "「あららぁ～♡捕まっちゃたのねぇ♡そ、れ、と、もぉ・・・ワザとじゃないわよね？」"
    },
    {
        "id": "3025",
        "name": "［ボク！競る！in！べー！だろーが！］ネオンマルチレッグ",
        "quote": "「君がボクを選んだ？逆！逆！ボクが君を選んだんだ！"
    },
    {
        "id": "3026",
        "name": "[深赫たる柘榴]　アルマンダイン",
        "quote": "「羅針盤が示すのは未踏の航路。貴方の舵取り、お手並み拝見といたしましょう。」"
    },
    {
        "id": "3027",
        "name": "［UONグループ社長令嬢］ウオンシルヴィ",
        "quote": "「見つけたわね……褒美に黄色ラベルのカレーを食べる義務をあげるわ！！」"
    },
    {
        "id": "3028",
        "name": "［奇跡で研いだ妖刀］カケハムラマサ",
        "quote": "「『ハッピーエンドの代名詞』『妖刀』……好きな名前で呼んでよ」"
    },
    {
        "id": "3029",
        "name": "［1P/10Ys］レックストレメンデ",
        "quote": "「小さな身体に大きな野望！日本のレース界は私が支配するよ！」"
    },
    {
        "id": "3030",
        "name": "[Guardian of Long-Distance]　ヒシマック",
        "quote": "「期待外れだとか、大したことないだとか―― その言葉が間違っていたって、証明してみせます！」"
    },
    {
        "id": "3031",
        "name": "[S:19.8,Why 20?]ククリ",
        "quote": "「ワタシと一緒に感じよウ？理屈じゃナい夢を、楽しさを！」"
    },
    {
        "id": "3032",
        "name": "[義足の挑戦者]エッジランナー",
        "quote": "「義足が走ってるんじゃなくて、私が走ってるんだから！」"
    },
    {
        "id": "3033",
        "name": "[魂の道標]フィルムロール",
        "quote": "「今でも思い出します。焼き付いたあの景色を」"
    },
    {
        "id": "3034",
        "name": "[『常識』破り]ナガソネモロハ",
        "quote": "「ジンクスなんて全部ぶった斬って！ひっくり返してやったよ！全部！」"
    },
    {
        "id": "3035",
        "name": "［想い積む小さき重戦車］タンクタンクタンク",
        "quote": "「'今日も自分にできることを全力でやりきるっす！'」"
    },
    {
        "id": "3036",
        "name": "［冬空の仁川に］ブラッサイーグル",
        "quote": "「これが、『掴み取る』ということ…」"
    },
    {
        "id": "3037",
        "name": "［世界の灯火］ハイムリーゼ",
        "quote": "「誰よりも眩く、誰よりも速く…！！」"
    },
    {
        "id": "3038",
        "name": "[Freezing waltz]ネクストステップ",
        "quote": "｢どんなに折れても、次の1歩踏み出せば全て私の演技（レース）になる！｣"
    },
    {
        "id": "3039",
        "name": "[イッツァプリマベーラ!!]キラキラミライ",
        "quote": ""
    },
    {
        "id": "3040",
        "name": "[砂地の帝王] グダルナルシー",
        "quote": "「この僕の勇姿を網膜にまで焼き付けておくれよ！」"
    },
    {
        "id": "3041",
        "name": "[キミとのi]アイソリュート",
        "quote": ""
    },
    {
        "id": "3042",
        "name": "［走る哲学］ウィトゲンクリア",
        "quote": "「走る姿を見ればわかる。そこに言葉はいらないだろう。……以上だ」"
    }
];

const CHARACTERS_R2 = [
    {
        "id": "2001",
        "name": "［まろまろびっくばん！］ヤツダターマロ",
        "quote": ""
    },
    {
        "id": "2002",
        "name": "［TERROR or TELLER］マイスタイル",
        "quote": ""
    },
    {
        "id": "2003",
        "name": "［Horns UP!］イズミスカイゲート",
        "quote": ""
    },
    {
        "id": "2004",
        "name": "［まいぺーす・すわん！］マックスワン",
        "quote": ""
    },
    {
        "id": "2005",
        "name": "［LittleFirstStep］ゼロイチステップ",
        "quote": ""
    },
    {
        "id": "2006",
        "name": "［Wind für Freunde］ヴィントブリッツ",
        "quote": ""
    },
    {
        "id": "2007",
        "name": "［69 to you ♡］ロックトゥーユー",
        "quote": ""
    },
    {
        "id": "2008",
        "name": "［キミにビビっと！］ビビットメモリー",
        "quote": ""
    },
    {
        "id": "2009",
        "name": "［蒼き熱狂］ヒーローサイン",
        "quote": ""
    },
    {
        "id": "2010",
        "name": "［Frame Soul］バーンテイル",
        "quote": ""
    },
    {
        "id": "2011",
        "name": "［一糸断決］ダテノダンケツ",
        "quote": ""
    },
    {
        "id": "2012",
        "name": "［Von dir gefärbt werden］シュバルツロートス",
        "quote": ""
    },
    {
        "id": "2013",
        "name": "［闇を往く］ナイトリッジ",
        "quote": ""
    },
    {
        "id": "2014",
        "name": "［Knight Load］ロイヤルガード",
        "quote": ""
    },
    {
        "id": "2015",
        "name": "［Stary Waltz］グロウアンタレス",
        "quote": ""
    },
    {
        "id": "2016",
        "name": "［B'FLY］アルカナライン",
        "quote": ""
    },
    {
        "id": "2017",
        "name": "［Steal your heart］ワンダーシーフ",
        "quote": ""
    },
    {
        "id": "2018",
        "name": "［Fleur Mignon］ルミナスアイビー",
        "quote": ""
    },
    {
        "id": "2019",
        "name": "［無彩の旅人］リンピダアニマ",
        "quote": ""
    },
    {
        "id": "2020",
        "name": "［AXEL H.e.A.r.T］アクセルビート",
        "quote": ""
    },
    {
        "id": "2021",
        "name": "［涙の数だけ］イタルカレンデュラ",
        "quote": ""
    },
    {
        "id": "2022",
        "name": "［Stuff × n → Golden］ビッグアルケミスト",
        "quote": ""
    },
    {
        "id": "2023",
        "name": "［二四式学徒潜水給仕服］オーツートーピード",
        "quote": ""
    },
    {
        "id": "2024",
        "name": "［崑崙公主］クンルンハーミット",
        "quote": ""
    },
    {
        "id": "2025",
        "name": "[暗き深森の著者]デルタケルベロス",
        "quote": ""
    },
    {
        "id": "2026",
        "name": "[雨あられ！のち弾幕！]スティールスコール",
        "quote": ""
    },
    {
        "id": "2027",
        "name": "[湧き上がれ！生命のイシ！]フォッシルフュエル",
        "quote": ""
    },
    {
        "id": "2028",
        "name": "[Till’ I brighten]ティルキュール",
        "quote": ""
    },
    {
        "id": "2029",
        "name": "［砂上の一等星］シルファポラリス",
        "quote": ""
    },
    {
        "id": "2030",
        "name": "[雷霆]ライトニングレオン(現役バージョン)",
        "quote": ""
    }
];

const CHARACTERS_R1 = [
    {
        "id": "1001",
        "name": "［光刃連理］ナガソネモロハ",
        "quote": ""
    },
    {
        "id": "1002",
        "name": "［Call my soul］イノセントゴースト",
        "quote": ""
    },
    {
        "id": "1003",
        "name": "［Alive 5555］ワンモアタイム",
        "quote": ""
    },
    {
        "id": "1004",
        "name": "［大樹］ユメミノデンパ",
        "quote": ""
    },
    {
        "id": "1005",
        "name": "［王ヲモ煩ワス道化師］ダームデジョーカー",
        "quote": ""
    },
    {
        "id": "1006",
        "name": "［閉鎖書庫］ミスカトニアン",
        "quote": ""
    },
    {
        "id": "1007",
        "name": "［天下駆ける無双の槍］ムソウイチバンヤリ",
        "quote": ""
    },
    {
        "id": "1008",
        "name": "［Command?→623!］ワンクレジット",
        "quote": ""
    },
    {
        "id": "1009",
        "name": "［日本の中核］ベイワインレッド",
        "quote": ""
    },
    {
        "id": "1010",
        "name": "［軌跡の繋ぎ手］ハイムリーゼ",
        "quote": ""
    },
    {
        "id": "1011",
        "name": "［静カニ巡テ］シズメグリ",
        "quote": ""
    },
    {
        "id": "1012",
        "name": "［光芒一条］ホープライトコード",
        "quote": ""
    },
    {
        "id": "1013",
        "name": "［弾ける火花］スパークダーター",
        "quote": ""
    },
    {
        "id": "1014",
        "name": "［霧我霧中］ミスティフォレスト",
        "quote": ""
    },
    {
        "id": "1015",
        "name": "［煌めきの女王］ルミナスクイーン",
        "quote": ""
    },
    {
        "id": "1016",
        "name": "［個道の結論］コンクルージョン",
        "quote": ""
    },
    {
        "id": "1017",
        "name": "［Fly in the sky!!］マンタスカイ ※障害ver.",
        "quote": ""
    },
    {
        "id": "1018",
        "name": "［Come to the surface］オルカナイト",
        "quote": ""
    },
    {
        "id": "1019",
        "name": "［サンライズスカイ］シャインアンバー",
        "quote": ""
    },
    {
        "id": "1020",
        "name": "［Cadeau pour toi］イタルダリアブーケ",
        "quote": ""
    },
    {
        "id": "1021",
        "name": "［漆黒の閃光］クロノトワレ",
        "quote": ""
    },
    {
        "id": "1022",
        "name": "［しるばー☆ぷちでびる！］アグネスディアボロ",
        "quote": ""
    },
    {
        "id": "1023",
        "name": "［A.U.S.U.S Standby］ブランクドリャフカ",
        "quote": ""
    },
    {
        "id": "1024",
        "name": "［白衣のスポットライト］ビビアンジュラダー",
        "quote": ""
    },
    {
        "id": "1025",
        "name": "[metal/mental to heat/heart]ミシオントレース",
        "quote": ""
    },
    {
        "id": "1026",
        "name": "[Cheerful or gloomy]シトリンノライフル",
        "quote": ""
    },
    {
        "id": "1027",
        "name": "[宝珠と鉄槌]エコーラルフレイル",
        "quote": ""
    },
    {
        "id": "1028",
        "name": "[はらぺこストマック]ナトリアム（地方ダート形態）",
        "quote": ""
    },
    {
        "id": "1029",
        "name": "［Radical gale］ドーンホライズン",
        "quote": ""
    },
    {
        "id": "1030",
        "name": "[再びのキセキを]ワンダーチェスナ",
        "quote": ""
    },
    {
        "id": "1031",
        "name": "[特記事項なき一等星]コモンキュール",
        "quote": ""
    },
    {
        "id": "1032",
        "name": "[Brand new wish]グロウティアナ",
        "quote": ""
    },
    {
        "id": "1033",
        "name": "[花待孤月]ギオンチドリ",
        "quote": ""
    },
    {
        "id": "1034",
        "name": "[昔日の想い]ライトニングレオン(教師バージョン)",
        "quote": ""
    },
    {
        "id": "1035",
        "name": "［白銀の脚光］アーメルディア",
        "quote": ""
    },
    {
        "id": "1036",
        "name": "［こうちのほれぼれおとめ！］ヒトメミテホレボレ",
        "quote": ""
    }
];
