// ==========================================
// キャラクターリスト
// (maker.html で生成したコードをここに貼り付けます)
// ==========================================

const CHARACTERS_R4 = [
    {
        "id": "401",
        "name": "［ポンタ王国王女］ポンタコテリシャス",
        "quote": "「………マロぉ！？なんで見つけたのじゃあ！？！？」"
    }
];

const CHARACTERS_R3 = [
    {
        "id": "301",
        "name": "［日ノ本断ツ大太刀］ネネキリミソギ",
        "quote": "「アンタたち……ぜーんいん！ぶった斬ってやるわよ！！」"
    },
    {
        "id": "302",
        "name": "［Becoming The Legacy］ディレツェッド",
        "quote": "「ウマ娘なら、目立って覚えられてなんぼっしょ！」"
    },
    {
        "id": "303",
        "name": "［Dual Movement］デュオモンテ",
        "quote": "「箱庭に生かされた花よ、私という路傍の華に枯らされろ」"
    },
    {
        "id": "304",
        "name": "［星空を見上げて！！！］ホルススターズアイ",
        "quote": "「天才の私が、勝利という輝きをあなたに魅せてあげます！！！」"
    },
    {
        "id": "305",
        "name": "［原初を穿つダートフォージ］ガンエレメンツ",
        "quote": "「世界を穿いた力、見せてやる。ーー覚悟しときな」"
    },
    {
        "id": "306",
        "name": "［超越せし帝王］ジャックラパット",
        "quote": "「限界を知らぬ王の走り、その目に焼き付けよ！！」"
    },
    {
        "id": "307",
        "name": "［貴方の為に鐘は鳴る］カンパネラ",
        "quote": "「この道は私の道、いつか誰かに出会う、その為の」"
    },
    {
        "id": "308",
        "name": "［Access Answer］アンカーコード",
        "quote": ""
    },
    {
        "id": "309",
        "name": "［王道］キルシュブリューテ",
        "quote": "「相手がどれだけ強くても……主役を譲る気はありません」"
    },
    {
        "id": "310",
        "name": "［紅輝の女皇］スカーレットクラン",
        "quote": "「伊達と！酔狂と！溢れる浪漫！織りなす輝きこそ余！女皇の行く覇道である！」"
    },
    {
        "id": "311",
        "name": "［Forge Own Ways］フェルムハルジオン",
        "quote": "「何度でも鍛ち直す、それが私の信念！折れるものなら折ってみなさい！」"
    },
    {
        "id": "312",
        "name": "［Iris］セイリングデイズ",
        "quote": ""
    },
    {
        "id": "313",
        "name": "［piercing the heart］バレットスマッシュ",
        "quote": "「世界中のハートを、私の走りで撃ち抜いてあげるよ」"
    },
    {
        "id": "314",
        "name": "［ナゼ・ソノナ・ナノカ？］ナノナイハナ",
        "quote": "「〜～♪……私の声は、魔性だから♪」"
    }
];

const CHARACTERS_R2 = [
    {
        "id": "201",
        "name": "［まろまろびっくばん！］ヤツダターマロ",
        "quote": ""
    },
    {
        "id": "202",
        "name": "［TERROR or TELLER］マイスタイル",
        "quote": ""
    },
    {
        "id": "203",
        "name": "［Horns UP!］イズミスカイゲート",
        "quote": ""
    },
    {
        "id": "204",
        "name": "［まいぺーす・すわん！］マックスワン",
        "quote": ""
    },
    {
        "id": "205",
        "name": "［LittleFirstStep］ゼロイチステップ",
        "quote": ""
    },
    {
        "id": "206",
        "name": "［Wind für Freunde］ヴィントブリッツ",
        "quote": ""
    },
    {
        "id": "207",
        "name": "［69 to you ♡］ロックトゥーユー",
        "quote": ""
    },
    {
        "id": "208",
        "name": "［キミにビビっと！］ビビットメモリー",
        "quote": ""
    },
    {
        "id": "209",
        "name": "［蒼き熱狂］ヒーローサイン",
        "quote": ""
    },
    {
        "id": "210",
        "name": "［Frame Soul］バーンテイル",
        "quote": ""
    },
    {
        "id": "211",
        "name": "［一糸断決］ダテノダンケツ",
        "quote": ""
    },
    {
        "id": "212",
        "name": "［Von dir gefärbt werden］シュバルツロートス",
        "quote": ""
    },
    {
        "id": "213",
        "name": "［闇を往く］ナイトリッジ",
        "quote": ""
    },
    {
        "id": "214",
        "name": "［Knight Load］ロイヤルガード",
        "quote": ""
    },
    {
        "id": "215",
        "name": "［Stary Waltz］グロウアンタレス",
        "quote": ""
    },
    {
        "id": "216",
        "name": "［B'FLY］アルカナライン",
        "quote": ""
    }
];

const CHARACTERS_R1 = [
    {
        "id": "101",
        "name": "［光刃連理］ナガソネモロハ",
        "quote": ""
    },
    {
        "id": "102",
        "name": "［Call my soul］イノセントゴースト",
        "quote": ""
    },
    {
        "id": "103",
        "name": "［Alive 5555］ワンモアタイム",
        "quote": ""
    },
    {
        "id": "104",
        "name": "［大樹］ユメミノデンパ",
        "quote": ""
    },
    {
        "id": "105",
        "name": "［王ヲモ煩ワス道化師］ダームデジョーカー",
        "quote": ""
    },
    {
        "id": "106",
        "name": "［閉鎖書庫］ミスカトニアン",
        "quote": ""
    },
    {
        "id": "107",
        "name": "［天下駆ける無双の槍］ムソウイチバンヤリ",
        "quote": ""
    },
    {
        "id": "108",
        "name": "［Command?→623!］ワンクレジット",
        "quote": ""
    },
    {
        "id": "109",
        "name": "［日本の中核］ベイワインレッド",
        "quote": ""
    },
    {
        "id": "110",
        "name": "［軌跡の繋ぎ手］ハイムリーゼ",
        "quote": ""
    },
    {
        "id": "111",
        "name": "［静カニ巡テ］シズメグリ",
        "quote": ""
    },
    {
        "id": "112",
        "name": "［光芒一条］ホープライトコード",
        "quote": ""
    },
    {
        "id": "113",
        "name": "［弾ける火花］スパークダーター",
        "quote": ""
    },
    {
        "id": "114",
        "name": "［霧我霧中］ミスティフォレスト",
        "quote": ""
    }
];
